content/notas/Declarativa/Notas.org
#+title: Programación Declarativa
#+author: Erik Rangel Limón
#+startup: content
#+startup: latexpreview

Cambio en el horario

lunes y miércoles de 17 a 16:30

No habrá laboratorio

* Evaluación

  | Rubro          | Porcentaje |
  |----------------+------------|
  | Tareas         |        60% |
  | Proyecto final |        40% |
  
* Notas de Clase

** Clase 1

*** Temario

    1. Programación lógica (Prolog)

    2. Programación funcional (Haskell)

    3. Programación declarativa con otros estilos

    4. Programación declarativa en el mundo
  
** Clase 2

*** Prolog (Tarea)

    * Es un lenguaje muy ligado con la inteligencia artificial y con
      la lingüística computacional.
      
    * Tiene sus raíces en la lógica de primer orden y la lógica
      formal.
      
    * Es un lenguaje principalmente declarativo.

    * Tiene extensiones y versiones con características imperativas,
      concurrentes.

    * El funcionamiento del lenguaje es mediante relaciones, las
      cuales pueden representar hechos o reglas, con las que una
      computación se puede realizar mediante una búsqueda sobre éstas
      relaciones.

    * Conclusiones lógicas (relaciones).

    * Tiene wildcards.

    * Tiene listas.

    * Fue uno de los primeros lenguajes lógicos, y sigue siendo el
      lenguaje más popular de ellos, de la cual se distribuyen varias
      versiones de ellos.

    * Es mayormente utilizado para demostraciones de teoremas,
      sistemas expertos, reescripción de términos, así como también
      para el procesamiento de lenguaje natural, el cual fue su
      intensión de uso original.
   
*** Lenguaje Funcional

    - Funcional:

      Tiene efectos secundarios, como entradas aleatorias, escritura y
      lectura del disco, hora y tiempo, entre otras cosas.
      
    - Puramente funcional:

      Evita en la mayoría de lo posible los efectos secundarios de una
      computadora.

** Clase 3
   
*** Haskell

    - Es un lenguaje puramente funcional

    - Currificación; lo que quiere decir es que una función con varios
      parámetros la convierte a varias funciones de un sólo parámetro.

    - Philip Wadler introdujo la teoría de categorías a la
      programación funcional, lo que permitió el uso de efectos
      secundarios en lenguajes puramente funcionales.

** Clase 4

*** Paradigma / Estilo de Programación

    Existen dos principales
    
**** Imperativo (Cómo)

     Éste se enfoca más en explicar un programa como un conjunto de
     instrucciones.

***** ¿Por qué son Turing Completos?

      Se ha demostrado que si un lenguaje imperativo tiene:

      - Secuencia
      - Decisión
      - Repetición


      Entonces el lenguaje es turing completo.
     
**** Declarativo (Qué)

     Estos nacen a partir de conceptos de las matemáticas

     Uno de los primeros lenguajes declarativos fue lisp como una
     nueva manera de programar, el cual intentó utilizar el cálculo
     lambda para su sintaxis.

     A partir de *Lisp* surgen algunas vertientes que implementan de
     manera correcta el cálculo lambda, como /Haskell/, /Ocaml/, /Scheme/,
     /Racket/.

     Una de las características de los lenguajes declarativos son las
     siguientes:

     - Utilizan la recursión como método de iteración.

     - Es más fácil demostrar que un algoritmo es correcto.

     - Las funciones actúan como miembros de primera clase.

     - Sistemas de tipos "elegantes".

     - No tienen efectos secundarios, si el lenguaje no los tiene en
       su totalidad se dice entonces que es un leguaje puro.

     - Tienen fuertes bases matemáticas como la lógica, el cálculo
       $\lambda$, y la teoría de categorías.

     - Evaluación perezosa (/Lazy evaluation/).

     - Por lo general existen listas en los lenguajes declarativos.
    
***** ¿Por qué es Turing Completo?

      Sabemos que el Cálculo $\lambda$ es equivalente a una Máquina de
      Turing, por lo que un lenguaje declarativo será Turing Completo
      si tiene:

      - Funciones
      - Aplicaciones
      - Variables
      
*** Lenguajes lógicos

    - Usa hechos y reglas de inferencia
    - Tiene como base la lógica de la primer orden
    - Usa cláusulas de Horn
    - Unificación (Resolución binaria)
    - Retroceso
      
