notas/Declarativa/Notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-08 Tue 22:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programación Declarativa</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Programación Declarativa</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org330f802">Evaluación</a></li>
<li><a href="#org8ea49f9">Notas de Clase</a>
<ul>
<li><a href="#orga9970d1">Clase 1</a>
<ul>
<li><a href="#org17185cb">Temario</a></li>
</ul>
</li>
<li><a href="#orgaef7a2a">Clase 2</a>
<ul>
<li><a href="#org3b9adfb">Prolog (Tarea)</a></li>
<li><a href="#org427df16">Lenguaje Funcional</a></li>
</ul>
</li>
<li><a href="#org3e3b8ee">Clase 3</a>
<ul>
<li><a href="#orgfbd861d">Haskell</a></li>
</ul>
</li>
<li><a href="#orgb2e20b0">Clase 4</a>
<ul>
<li><a href="#org05343be">Paradigma / Estilo de Programación</a></li>
<li><a href="#org31522cf">Lenguajes lógicos</a></li>
<li><a href="#org3f5afe3">Lenguajes funcionales</a></li>
<li><a href="#org72c7c68">Lógica de predicados</a></li>
</ul>
</li>
<li><a href="#org0e4b7fb">Clase 5</a>
<ul>
<li><a href="#org115ddc1">Lógica de predicados (Primer orden)</a></li>
</ul>
</li>
<li><a href="#orgde7eb13">Clase 6</a>
<ul>
<li><a href="#orgb1656d2">Fundamentos teóricos de la programación lógica</a></li>
<li><a href="#org766a07f">Cláusula</a></li>
<li><a href="#org7f416fd">Resolución binaria</a></li>
</ul>
</li>
<li><a href="#orge94e0f1">Clase 7</a>
<ul>
<li><a href="#org7ebc54c">Resolución binaria</a></li>
</ul>
</li>
<li><a href="#org74a8bc2">Clase 8</a>
<ul>
<li><a href="#org813561e">Programación lógica</a></li>
<li><a href="#orgb5e0f1a">Árbol SLD</a></li>
<li><a href="#org526267c">Prolog</a></li>
</ul>
</li>
<li><a href="#org8598fdc">Clase 9</a>
<ul>
<li><a href="#orgeeac800">Prolog</a></li>
</ul>
</li>
<li><a href="#org9d193e3">Clase 12</a>
<ul>
<li><a href="#orgbc66bbe">Listas en prolog</a></li>
</ul>
</li>
<li><a href="#orgd7dc2e8">Clase 13</a>
<ul>
<li><a href="#org1bc4381">Ejercicios prolog</a></li>
</ul>
</li>
<li><a href="#orgbe1ebf5">Clase 14</a>
<ul>
<li><a href="#orgfae2d93">Prolog operadores</a></li>
<li><a href="#orgb77f12a">Precedencia</a></li>
<li><a href="#orga1c7d59">Asociatividad</a></li>
<li><a href="#org7d5b156">Definir operadores en prolog</a></li>
<li><a href="#orgddd57e0">No determinismo en prolog</a></li>
</ul>
</li>
<li><a href="#orgd3ef5d9">Clase 15</a>
<ul>
<li><a href="#orgba79901">Fibonacci en prolog</a></li>
<li><a href="#org05a2660">Operador de corte en prolog</a></li>
<li><a href="#org851b1e8">Negación como falla</a></li>
<li><a href="#org26f14dc">Programación funcional</a></li>
</ul>
</li>
<li><a href="#org1bed1e0">Clase 16</a>
<ul>
<li><a href="#orga9f254d">Recursión de cola</a></li>
</ul>
</li>
<li><a href="#org2684573">Clase 17</a>
<ul>
<li><a href="#org93a0088">Propiedad universal</a></li>
<li><a href="#orgb621d83">Principio de fusión</a></li>
</ul>
</li>
<li><a href="#orgb5e8def">Clase 18</a>
<ul>
<li><a href="#org7c62dc9">Evaluación perezosa</a></li>
<li><a href="#org6738045">Sistemas de tipos</a></li>
<li><a href="#org719ce0c">Definición de tipos en Haskell</a></li>
<li><a href="#orgec44e48">Inferencia de tipos</a></li>
<li><a href="#orge9172ac">Clases de tipos</a></li>
</ul>
</li>
<li><a href="#org6b26a3b">Clase 19</a>
<ul>
<li><a href="#org91dd823">Kinds</a></li>
</ul>
</li>
<li><a href="#org596bb17">Clase 20</a>
<ul>
<li><a href="#org96181f9">Construcción del sistema</a></li>
</ul>
</li>
<li><a href="#org9eed503">Clase 21</a>
<ul>
<li><a href="#org685f981">Funtores, funtores aplicativos y mónadas</a></li>
</ul>
</li>
<li><a href="#orgd80ba31">Clase 22</a>
<ul>
<li><a href="#orge23d911">Programación funcional</a></li>
<li><a href="#orgc093e0d">Lenguajes multiparadigma</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org23dad15">Tareas <code>[1/2]</code></a></li>
</ul>
</div>
</div>
<p>
Cambio en el horario
</p>

<p>
lunes y miércoles de 17 a 16:30
</p>

<p>
No habrá laboratorio
</p>

<div id="outline-container-org330f802" class="outline-2">
<h2 id="org330f802">Evaluación</h2>
<div class="outline-text-2" id="text-org330f802">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rubro</th>
<th scope="col" class="org-right">Porcentaje</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tareas</td>
<td class="org-right">60%</td>
</tr>

<tr>
<td class="org-left">Proyecto final</td>
<td class="org-right">40%</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8ea49f9" class="outline-2">
<h2 id="org8ea49f9">Notas de Clase</h2>
<div class="outline-text-2" id="text-org8ea49f9">
</div>
<div id="outline-container-orga9970d1" class="outline-3">
<h3 id="orga9970d1">Clase 1</h3>
<div class="outline-text-3" id="text-orga9970d1">
</div>
<div id="outline-container-org17185cb" class="outline-4">
<h4 id="org17185cb">Temario</h4>
<div class="outline-text-4" id="text-org17185cb">
<ol class="org-ol">
<li>Programación lógica (Prolog)</li>

<li>Programación funcional (Haskell)</li>

<li>Programación declarativa con otros estilos</li>

<li>Programación declarativa en el mundo</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgaef7a2a" class="outline-3">
<h3 id="orgaef7a2a">Clase 2</h3>
<div class="outline-text-3" id="text-orgaef7a2a">
</div>
<div id="outline-container-org3b9adfb" class="outline-4">
<h4 id="org3b9adfb">Prolog (Tarea)</h4>
<div class="outline-text-4" id="text-org3b9adfb">
<ul class="org-ul">
<li>Es un lenguaje muy ligado con la inteligencia artificial y con
la lingüística computacional.</li>

<li>Tiene sus raíces en la lógica de primer orden y la lógica
formal.</li>

<li>Es un lenguaje principalmente declarativo.</li>

<li>Tiene extensiones y versiones con características imperativas,
concurrentes.</li>

<li>El funcionamiento del lenguaje es mediante relaciones, las
cuales pueden representar hechos o reglas, con las que una
computación se puede realizar mediante una búsqueda sobre éstas
relaciones.</li>

<li>Conclusiones lógicas (relaciones).</li>

<li>Tiene wildcards.</li>

<li>Tiene listas.</li>

<li>Fue uno de los primeros lenguajes lógicos, y sigue siendo el
lenguaje más popular de ellos, de la cual se distribuyen varias
versiones de ellos.</li>

<li>Es mayormente utilizado para demostraciones de teoremas,
sistemas expertos, reescripción de términos, así como también
para el procesamiento de lenguaje natural, el cual fue su
intensión de uso original.</li>
</ul>
</div>
</div>

<div id="outline-container-org427df16" class="outline-4">
<h4 id="org427df16">Lenguaje Funcional</h4>
<div class="outline-text-4" id="text-org427df16">
<ul class="org-ul">
<li><p>
Funcional:
</p>

<p>
Tiene efectos secundarios, como entradas aleatorias, escritura y
lectura del disco, hora y tiempo, entre otras cosas.
</p></li>

<li><p>
Puramente funcional:
</p>

<p>
Evita en la mayoría de lo posible los efectos secundarios de una
computadora.
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3e3b8ee" class="outline-3">
<h3 id="org3e3b8ee">Clase 3</h3>
<div class="outline-text-3" id="text-org3e3b8ee">
</div>
<div id="outline-container-orgfbd861d" class="outline-4">
<h4 id="orgfbd861d">Haskell</h4>
<div class="outline-text-4" id="text-orgfbd861d">
<ul class="org-ul">
<li>Es un lenguaje puramente funcional</li>

<li>Currificación; lo que quiere decir es que una función con varios
parámetros la convierte a varias funciones de un sólo parámetro.</li>

<li>Philip Wadler introdujo la teoría de categorías a la
programación funcional, lo que permitió el uso de efectos
secundarios en lenguajes puramente funcionales.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb2e20b0" class="outline-3">
<h3 id="orgb2e20b0">Clase 4</h3>
<div class="outline-text-3" id="text-orgb2e20b0">
</div>
<div id="outline-container-org05343be" class="outline-4">
<h4 id="org05343be">Paradigma / Estilo de Programación</h4>
<div class="outline-text-4" id="text-org05343be">
<p>
Existen dos principales
</p>
</div>

<ul class="org-ul">
<li><a id="org33e97c4"></a>Imperativo (Cómo)<br />
<div class="outline-text-5" id="text-org33e97c4">
<p>
Éste se enfoca más en explicar un programa como un conjunto de
instrucciones.
</p>
</div>

<ul class="org-ul">
<li><a id="org3226e57"></a>¿Por qué son Turing Completos?<br />
<div class="outline-text-6" id="text-org3226e57">
<p>
Se ha demostrado que si un lenguaje imperativo tiene:
</p>

<ul class="org-ul">
<li>Secuencia</li>
<li>Decisión</li>
<li>Repetición</li>
</ul>


<p>
Entonces el lenguaje es turing completo.
</p>
</div>
</li>
</ul>
</li>

<li><a id="org06bb666"></a>Declarativo (Qué)<br />
<div class="outline-text-5" id="text-org06bb666">
<p>
Estos nacen a partir de conceptos de las matemáticas
</p>

<p>
Uno de los primeros lenguajes declarativos fue lisp como una
nueva manera de programar, el cual intentó utilizar el cálculo
lambda para su sintaxis.
</p>

<p>
A partir de <b>Lisp</b> surgen algunas vertientes que implementan de
manera correcta el cálculo lambda, como <i>Haskell</i>, <i>Ocaml</i>, <i>Scheme</i>,
<i>Racket</i>.
</p>

<p>
Una de las características de los lenguajes declarativos son las
siguientes:
</p>

<ul class="org-ul">
<li>Utilizan la recursión como método de iteración.</li>

<li>Es más fácil demostrar que un algoritmo es correcto.</li>

<li>Las funciones actúan como miembros de primera clase.</li>

<li>Sistemas de tipos "elegantes".</li>

<li>No tienen efectos secundarios, si el lenguaje no los tiene en
su totalidad se dice entonces que es un leguaje puro.</li>

<li>Tienen fuertes bases matemáticas como la lógica, el cálculo
\(\lambda\), y la teoría de categorías.</li>

<li>Evaluación perezosa (<i>Lazy evaluation</i>).</li>

<li>Por lo general existen listas en los lenguajes declarativos.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org601d408"></a>¿Por qué es Turing Completo?<br />
<div class="outline-text-6" id="text-org601d408">
<p>
Sabemos que el Cálculo \(\lambda\) es equivalente a una Máquina de
Turing, por lo que un lenguaje declarativo será Turing Completo
si tiene:
</p>

<ul class="org-ul">
<li>Funciones</li>
<li>Aplicaciones</li>
<li>Variables</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org31522cf" class="outline-4">
<h4 id="org31522cf">Lenguajes lógicos</h4>
<div class="outline-text-4" id="text-org31522cf">
<ul class="org-ul">
<li>Usa hechos y reglas de inferencia</li>
<li>Tiene como base la lógica de la primer orden</li>
<li>Usa cláusulas de Horn</li>
<li>Unificación (Resolución binaria)</li>
<li>Retroceso</li>
</ul>
</div>
</div>
