content/notas/Declarativa/Notas.org
*** Lenguajes funcionales

    - Utiliza funciones para representar programas.
    - Usa $\beta$-reducciones para evaluar funciones.
    - Se llega cuando llega a una forma normal.
    - Usa teoría de categorías.

      + Patrones recursivos
      + Functores
      + Mónadas
      + Monoides
      + Aplicativos
      + Entre otros ...
      
*** Lógica de predicados

    La lógica proposicional tiene varias similitudes con la lógica de
    predicados, entre ellos sabemos que algunos son:

    - Sintaxis
    - Semántica
    - Deducción / Inferencia / Teoría de la prueba
    
    Sabemos que éste tiene:

    - Valores*
    - Constantes*
    - Predicados
    - Funciones*
    - Opoeradores
    - Cuantificadores


    * Estos son términos
    
** Clase 5

*** Lógica de predicados (Primer orden)

    Hereda las características de la lógica proposicional, agregángole
    los cuantificadores universales y existenciales.

    $U$ será nuestro universo de discurso, y a partir de ellos podemos
    determinar cuántos elementos de un universo cuentan con una
    propiedad.

    Vamos a tener variables, funciones y cuantificadores.

**** Equivalencias lógicas     

     1. \[\forall x.\forall x.\varphi\equiv\forall x. \varphi\]

     2. \[\exists x.\exists x.\varphi\equiv\exists x.\varphi\]

     3. \[\exists x.\forall x.\varphi\equiv\forall x.\varphi\]

     4. \[\forall x.\exists x.\varphi\equiv\exists x.\varphi\]

     5. \[\forall x.\varphi\equiv\forall y. (\varphi[x:=y])\]   \[y\notin FV(\varphi)\]

     6. \[\exists x.\varphi\equiv\exists y. (\varphi[x:=y])\]   \[y\notin FV(\varphi)\]

     7. \[\forall x.\varphi\equiv\varphi\]   \[x\notin FV(\varphi)\]

     8. \[\exists x.\varphi\equiv\varphi\]   \[x\notin FV(\varphi)\]
     
**** Formas normales

     1. Rectificación

	- Cuantificadores con variables ajenas

	  \[\forall x.\exists y.\neg\forall w.\exists z. (P(x,y)\vee\neg Q(x)\rightarrow \exists w. \neg T(a,w))\]

	  \[\Rightarrow \forall x.\exists y.\neg(P(x,y)\vee\neg Q(x)\rightarrow \exists u. \neg T(a,u))\]

     2. Forma Normal Negativa

	- Introduce negaciones a fórmulas atómicas

	- Quita $\Rightarrow$ y $\Leftrightarrow$

	  \[\forall x.\exists y.\neg(P(x,y)\vee\neg Q(x)\rightarrow \exists u. \neg T(a,u))\]

	  \[\Rightarrow \forall x.\exists y.\neg(\neg(P(x,y)\vee\neg Q(x))\vee\exists u.\neg T(a,u))\]

	  \[\Rightarrow \forall x.\exists y.\neg\neg(P(x,y)\vee\neg Q(x))\wedge\neg\exists u.\neg T(a,u)\]

	  \[\Rightarrow \forall x.\exists y.(P(x,y\vee\neg Q(x))\wegde\forall u.T(a,u))\]

     3. Forma Normal Pronex

	- Factoriza cuantificadores

	  \[\forall x.(\ldots\exists y.(\ldots))\Rightarrow \forall x.\exist y.(\ldots)\]

	  Si $x\in FV(\varphi)$ y $\star\in\{\wedge,\vee,\rightarrow\}$:

	  1. \[\varphi\star\forall x.\psi\equiv\forall x.(\varphi\star\psi)\]

	  2. \[\varphi\star\exists x.\psi\equiv\exists x.(\varphi\star\psi)\]


     \[\forall x.\exists y.(P(x,y\vee\neg Q(x))\wegde\forall u.T(a,u))\]

     \[\Rightarrow\forall x.\exists y.\forall u. (P(x,y)\vee\neg Q(x))\wedge T(a,u)\]

     1. Forma Normal de Skolen

	- Elimina cuantificadores existenciales

	  1. $\exists x.\varphi\cong \varphi[x:=c]$

	  2. $\forall x_1\ldots\forall x_n.\exists y.\varphi\cong \forall x_1\ldots\forall x_n. \varphi[y:=g(x_1,\ldots,x_n)]$


     \[\forall x.\exists y.\forall u. (P(x,y)\vee\neg Q(x))\wedge T(a,u)\]

     \[\Rightarrow\forall x.\forall u. (P(x,f(x))\vee\neg Q(x))\wedge T(a,u)\]

     2. Forma Clausular

	- Representación sin $\forall$.

     \[\forall x.\forall u. (P(x,f(x))\vee\neg Q(x))\wedge T(a,u)\]

     \[\Rightarrow \{P(x,f(x))\vee\neg Q(x), T(a,u)\}\]

     /Nota adicional A/
     
** Clase 6

*** Fundamentos teóricos de la programación lógica

**** Lógica de primer orden

     - Fórmulas atómicas:

       + Constantes lógicas $\top$, $\bot$

       + Predicados aplicados a términos.

     - Términos:

       + Constantes: $(c_1,\ldots,c_n)$

       + Variables $(x_1,\ldots,x_n)$

       + Funciones aplicadas a términos $f(t_1,\ldots,t_n)$

     - Fórmulas compuestas:

       + Conectivos $(\neg,\wedge,\vee,\rightarrow,\leftrightarrow)$

       + Cuantificadores $(\exists x.\varphi,\exists x.\varphi)$


     "Hay dos pizzas, la primera es de pepperoni, la segunda de
     hawaiana.

     Sólo como pizza si hay hawaiana

     ¿Puedo comer pizza?"

     En la programación lógica vamos a tener:
     
     - Cláusulas que representan lo que sabemos del problema, llamadas
       base de conocimiento.
       
     - Una cláusula llamada cuestión, llamada consulta.

     - Para saber si la consulta es verdadera o falsa, aplicaremos
       resolución binaria con unificación. Si podemos llegar a la
       cláusula vacía decimos que la consulta es verdadera.

*** Cláusula

    Una cláusula es una disyunción de fórmulas atómicas o su negación
    (literales).

    $C=\ell_1\vee\ell_2\vee\cdots\ell_n$

    * Notación conjuntista

      \[C=\{\ell_1,\ldots,\ell_n\}\]


    1. Conmutatividad

       $P_i$ positivas

       $Q_i$ negativas

       \[\neg P_1\vee\neg P_2\vee\ldots\vee\neg P_n\vee Q_1\vee Q_2\vee\cdots\vee Q_n\]

    2. De Morgan

       \[\]\[\neg(P_1\wedge\cdots\wedge P_j)\vee(Q_1\vee Q_2\vee\cdots\vee Q_n)\]

    3. Definición de implicación

       \[(P_1\wedge\cdots\wedge P_j)\rightarrow(Q_1\vee Q_2\vee\cdots\vee Q_n)\]

    4. Quitando operadores

       $P_1,P_2,\ldots,P_n\rightarrow Q_1,Q_2,\ldots,Q_n$

    5. Volteamos la implicación

       \[P_1,P_2,\ldots,P_n\rightarrow Q_1,Q_2,\ldots,Q_n\]


    * *Cláusula de Horn*.

      Es una cláusula con a lo más una literal positiva. Las cláusulas
      de Horn son a lo más alguna de las siguientes.

      - Hechos: Una literal positiva y ninguna negativa.

      - Reglas: Una literal positiva y al menos una negativa.

      - Metas: Ninugna positiva y al menos una negativa.

      - Vacía: Sin literales


    Un programa lógico P es un conjunto de hechos y reglas (base de
    conocimientos). Las consultas se representan con metas.

    Dado un programa $\mathbb{P}$ y una consulta $C$ queremos verificar

    \[\mathbb{P}\models C\]

    \[\exists x. P(x),\exists y. H(y),\forall z.(H(z)\rightarrow C(z)),C(x)\]

    \[\{P(a),P(b),\neg H(z)\vee C(z),\neg C(x)\}\]

    El programa lógico entonces se vería como sigue:

    \[P(a)\leftarrow\]

    \[H(b)\leftarrow\]

    \[C(z)\leftarrow H(z)\]

    Consulta: $\leftarrow C(x)$
    
