notas/Declarativa/Notas.html

<div id="outline-container-org3f5afe3" class="outline-4">
<h4 id="org3f5afe3">Lenguajes funcionales</h4>
<div class="outline-text-4" id="text-org3f5afe3">
<ul class="org-ul">
<li>Utiliza funciones para representar programas.</li>
<li>Usa $&beta;$-reducciones para evaluar funciones.</li>
<li>Se llega cuando llega a una forma normal.</li>
<li>Usa teoría de categorías.

<ul class="org-ul">
<li>Patrones recursivos</li>
<li>Functores</li>
<li>Mónadas</li>
<li>Monoides</li>
<li>Aplicativos</li>
<li>Entre otros &#x2026;</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org72c7c68" class="outline-4">
<h4 id="org72c7c68">Lógica de predicados</h4>
<div class="outline-text-4" id="text-org72c7c68">
<p>
La lógica proposicional tiene varias similitudes con la lógica de
predicados, entre ellos sabemos que algunos son:
</p>

<ul class="org-ul">
<li>Sintaxis</li>
<li>Semántica</li>
<li>Deducción / Inferencia / Teoría de la prueba</li>
</ul>

<p>
Sabemos que éste tiene:
</p>

<ul class="org-ul">
<li>Valores*</li>
<li>Constantes*</li>
<li>Predicados</li>
<li>Funciones*</li>
<li>Opoeradores</li>
<li>Cuantificadores</li>
</ul>


<ul class="org-ul">
<li>Estos son términos</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0e4b7fb" class="outline-3">
<h3 id="org0e4b7fb">Clase 5</h3>
<div class="outline-text-3" id="text-org0e4b7fb">
</div>
<div id="outline-container-org115ddc1" class="outline-4">
<h4 id="org115ddc1">Lógica de predicados (Primer orden)</h4>
<div class="outline-text-4" id="text-org115ddc1">
<p>
Hereda las características de la lógica proposicional, agregángole
los cuantificadores universales y existenciales.
</p>

<p>
\(U\) será nuestro universo de discurso, y a partir de ellos podemos
determinar cuántos elementos de un universo cuentan con una
propiedad.
</p>

<p>
Vamos a tener variables, funciones y cuantificadores.
</p>
</div>

<ul class="org-ul">
<li><a id="org7970d3b"></a>Equivalencias lógicas<br />
<div class="outline-text-5" id="text-org7970d3b">
<ol class="org-ol">
<li>\[\forall x.\forall x.\varphi\equiv\forall x. \varphi\]</li>

<li>\[\exists x.\exists x.\varphi\equiv\exists x.\varphi\]</li>

<li>\[\exists x.\forall x.\varphi\equiv\forall x.\varphi\]</li>

<li>\[\forall x.\exists x.\varphi\equiv\exists x.\varphi\]</li>

<li>\[\forall x.\varphi\equiv\forall y. (\varphi[x:=y])\]   \[y\notin FV(\varphi)\]</li>

<li>\[\exists x.\varphi\equiv\exists y. (\varphi[x:=y])\]   \[y\notin FV(\varphi)\]</li>

<li>\[\forall x.\varphi\equiv\varphi\]   \[x\notin FV(\varphi)\]</li>

<li>\[\exists x.\varphi\equiv\varphi\]   \[x\notin FV(\varphi)\]</li>
</ol>
</div>
</li>

<li><a id="org68a3207"></a>Formas normales<br />
<div class="outline-text-5" id="text-org68a3207">
<ol class="org-ol">
<li>Rectificación

<ul class="org-ul">
<li><p>
Cuantificadores con variables ajenas
</p>

<p>
\[\forall x.\exists y.\neg\forall w.\exists z. (P(x,y)\vee\neg Q(x)\rightarrow \exists w. \neg T(a,w))\]
</p>

<p>
\[\Rightarrow \forall x.\exists y.\neg(P(x,y)\vee\neg Q(x)\rightarrow \exists u. \neg T(a,u))\]
</p></li>
</ul></li>

<li>Forma Normal Negativa

<ul class="org-ul">
<li>Introduce negaciones a fórmulas atómicas</li>

<li><p>
Quita \(\Rightarrow\) y \(\Leftrightarrow\)
</p>

<p>
\[\forall x.\exists y.\neg(P(x,y)\vee\neg Q(x)\rightarrow \exists u. \neg T(a,u))\]
</p>

<p>
\[\Rightarrow \forall x.\exists y.\neg(\neg(P(x,y)\vee\neg Q(x))\vee\exists u.\neg T(a,u))\]
</p>

<p>
\[\Rightarrow \forall x.\exists y.\neg\neg(P(x,y)\vee\neg Q(x))\wedge\neg\exists u.\neg T(a,u)\]
</p>

<p>
\[\Rightarrow \forall x.\exists y.(P(x,y\vee\neg Q(x))\wegde\forall u.T(a,u))\]
</p></li>
</ul></li>

<li>Forma Normal Pronex

<ul class="org-ul">
<li><p>
Factoriza cuantificadores
</p>

<p>
\[\forall x.(\ldots\exists y.(\ldots))\Rightarrow \forall x.\exist y.(\ldots)\]
</p>

<p>
Si \(x\in FV(\varphi)\) y \(\star\in\{\wedge,\vee,\rightarrow\}\):
</p>

<ol class="org-ol">
<li>\[\varphi\star\forall x.\psi\equiv\forall x.(\varphi\star\psi)\]</li>

<li>\[\varphi\star\exists x.\psi\equiv\exists x.(\varphi\star\psi)\]</li>
</ol></li>
</ul></li>
</ol>


<p>
\[\forall x.\exists y.(P(x,y\vee\neg Q(x))\wegde\forall u.T(a,u))\]
</p>

<p>
\[\Rightarrow\forall x.\exists y.\forall u. (P(x,y)\vee\neg Q(x))\wedge T(a,u)\]
</p>

<ol class="org-ol">
<li>Forma Normal de Skolen

<ul class="org-ul">
<li>Elimina cuantificadores existenciales

<ol class="org-ol">
<li>\(\exists x.\varphi\cong \varphi[x:=c]\)</li>

<li>\(\forall x_1\ldots\forall x_n.\exists y.\varphi\cong \forall x_1\ldots\forall x_n. \varphi[y:=g(x_1,\ldots,x_n)]\)</li>
</ol></li>
</ul></li>
</ol>


<p>
\[\forall x.\exists y.\forall u. (P(x,y)\vee\neg Q(x))\wedge T(a,u)\]
</p>

<p>
\[\Rightarrow\forall x.\forall u. (P(x,f(x))\vee\neg Q(x))\wedge T(a,u)\]
</p>

<ol class="org-ol">
<li>Forma Clausular

<ul class="org-ul">
<li>Representación sin \(\forall\).</li>
</ul></li>
</ol>

<p>
\[\forall x.\forall u. (P(x,f(x))\vee\neg Q(x))\wedge T(a,u)\]
</p>

<p>
\[\Rightarrow \{P(x,f(x))\vee\neg Q(x), T(a,u)\}\]
</p>

<p>
<i>Nota adicional A</i>
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgde7eb13" class="outline-3">
<h3 id="orgde7eb13">Clase 6</h3>
<div class="outline-text-3" id="text-orgde7eb13">
</div>
<div id="outline-container-orgb1656d2" class="outline-4">
<h4 id="orgb1656d2">Fundamentos teóricos de la programación lógica</h4>
<div class="outline-text-4" id="text-orgb1656d2">
</div>
<ul class="org-ul">
<li><a id="org379bff9"></a>Lógica de primer orden<br />
<div class="outline-text-5" id="text-org379bff9">
<ul class="org-ul">
<li>Fórmulas atómicas:

<ul class="org-ul">
<li>Constantes lógicas \(\top\), \(\bot\)</li>

<li>Predicados aplicados a términos.</li>
</ul></li>

<li>Términos:

<ul class="org-ul">
<li>Constantes: \((c_1,\ldots,c_n)\)</li>

<li>Variables \((x_1,\ldots,x_n)\)</li>

<li>Funciones aplicadas a términos \(f(t_1,\ldots,t_n)\)</li>
</ul></li>

<li>Fórmulas compuestas:

<ul class="org-ul">
<li>Conectivos \((\neg,\wedge,\vee,\rightarrow,\leftrightarrow)\)</li>

<li>Cuantificadores \((\exists x.\varphi,\exists x.\varphi)\)</li>
</ul></li>
</ul>


<p>
"Hay dos pizzas, la primera es de pepperoni, la segunda de
hawaiana.
</p>

<p>
Sólo como pizza si hay hawaiana
</p>

<p>
¿Puedo comer pizza?"
</p>

<p>
En la programación lógica vamos a tener:
</p>

<ul class="org-ul">
<li>Cláusulas que representan lo que sabemos del problema, llamadas
base de conocimiento.</li>

<li>Una cláusula llamada cuestión, llamada consulta.</li>

<li>Para saber si la consulta es verdadera o falsa, aplicaremos
resolución binaria con unificación. Si podemos llegar a la
cláusula vacía decimos que la consulta es verdadera.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org766a07f" class="outline-4">
<h4 id="org766a07f">Cláusula</h4>
<div class="outline-text-4" id="text-org766a07f">
<p>
Una cláusula es una disyunción de fórmulas atómicas o su negación
(literales).
</p>

<p>
\(C=\ell_1\vee\ell_2\vee\cdots\ell_n\)
</p>

<ul class="org-ul">
<li><p>
Notación conjuntista
</p>

<p>
\[C=\{\ell_1,\ldots,\ell_n\}\]
</p></li>
</ul>


<ol class="org-ol">
<li><p>
Conmutatividad
</p>

<p>
\(P_i\) positivas
</p>

<p>
\(Q_i\) negativas
</p>

<p>
\[\neg P_1\vee\neg P_2\vee\ldots\vee\neg P_n\vee Q_1\vee Q_2\vee\cdots\vee Q_n\]
</p></li>

<li><p>
De Morgan
</p>

<p>
\[\]\[\neg(P_1\wedge\cdots\wedge P_j)\vee(Q_1\vee Q_2\vee\cdots\vee Q_n)\]
</p></li>

<li><p>
Definición de implicación
</p>

<p>
\[(P_1\wedge\cdots\wedge P_j)\rightarrow(Q_1\vee Q_2\vee\cdots\vee Q_n)\]
</p></li>

<li><p>
Quitando operadores
</p>

<p>
\(P_1,P_2,\ldots,P_n\rightarrow Q_1,Q_2,\ldots,Q_n\)
</p></li>

<li><p>
Volteamos la implicación
</p>

<p>
\[P_1,P_2,\ldots,P_n\rightarrow Q_1,Q_2,\ldots,Q_n\]
</p></li>
</ol>


<ul class="org-ul">
<li><p>
<b>Cláusula de Horn</b>.
</p>

<p>
Es una cláusula con a lo más una literal positiva. Las cláusulas
de Horn son a lo más alguna de las siguientes.
</p>

<ul class="org-ul">
<li>Hechos: Una literal positiva y ninguna negativa.</li>

<li>Reglas: Una literal positiva y al menos una negativa.</li>

<li>Metas: Ninugna positiva y al menos una negativa.</li>

<li>Vacía: Sin literales</li>
</ul></li>
</ul>


<p>
Un programa lógico P es un conjunto de hechos y reglas (base de
conocimientos). Las consultas se representan con metas.
</p>

<p>
Dado un programa \(\mathbb{P}\) y una consulta \(C\) queremos verificar
</p>

<p>
\[\mathbb{P}\models C\]
</p>

<p>
\[\exists x. P(x),\exists y. H(y),\forall z.(H(z)\rightarrow C(z)),C(x)\]
</p>

<p>
\[\{P(a),P(b),\neg H(z)\vee C(z),\neg C(x)\}\]
</p>

<p>
El programa lógico entonces se vería como sigue:
</p>

<p>
\[P(a)\leftarrow\]
</p>

<p>
\[H(b)\leftarrow\]
</p>

<p>
\[C(z)\leftarrow H(z)\]
</p>

<p>
Consulta: \(\leftarrow C(x)\)
</p>
</div>
</div>
