content/notas/Declarativa/Notas.org
*** Resolución binaria

    Es un método que permite decidir la consecuencia lógia
    $\Gamma\models\varphi$, al llegar a la cláusula vacía a partir del
    conjunto \[\Gamma\cup\{\neg\ell\}\]

    $\infer{(C_1\vee D_1)\sigma}{C=_{\text{def}}C_1\vee\ell & D=_{\text{def}}D_1\vee\ell' & Var(C)\cap Var(D)=\emptyset & \sigma=umg\ de\ \{\ell^c,\ell'\}}$


    
    
** Clase 7
*** Resolución binaria

    - Forma clausular
    - Algoritmo de unificación
** Clase 8
*** Programación lógica

    $P(a)\leftarrow$
    $H(b)\leftarrow$
    $C(z)\leftarrow H(z)$

    $\leftarrow C(x)$ Meta
    $\mathbb{P}\models C$

    1. $\leftarrow H(z)$ Res$(4,3)$ $[x:=z]$
    2. $\leftarrow$ Res(5,2) $[z:=b]$


    Hay dos procesos de búsqueda de pruebas en la programación lógica,
    en la cual tenemos la búsqueda hacia atrás, y la búsqueda hacia
    adelante.

    En prolog, tenemos lo que se conoce como backtracking (o
    retroceso)
    
*** Árbol SLD

    Tenemos el siguiente programa

    1. $p(a)\leftarrow$
    2. $p(b)\leftarrow$
    3. $q(a)\leftarrow$
    4. $r(f(y))\leftarrow p(y), q(y)$
    5. $\leftarrow r(x)$
    6. $\leftarrow p(y),q(y)$
    7. $\leftarrow q(a)$
    
*** Prolog

    #+begin_src prolog
% Tipos básicos
% Átomos (términos más pequeños)
juanito
m
esto_es_un_atomo
x1
,***
'esto es un átomo'

% Variables
X
EstoEsUnaVariable
_var
_

% Números
12313
1.92
-502

% Términos compuestos
% 1. Funtor (átomo)
% 2. Lista de argumentos
funtor(a,b)
'funtorcito'(termino)
g(f(a,b),h(c,d))
    #+end_src

    Primero en prolog se definen hechos y reglas, si queremos un
    programa para saber quién es más alto que alguien, tenemos lo
    siguiente.

    #+begin_src prolog
% Base de conocimientos
alto(juan,adriana).
alto(ricardo,juan).
alto(javier,ricardo).
alto(alejandro,adriana).
alto(javier,alejandro).

mas_alto(X,Y) :- alto(X,Y).
mas_alto(X,Y) :- alto(X,Z), mas_alto(Z,Y).
    #+end_src
    
** Clase 9
*** Prolog

    Éste utiliza el principio del universo cerrado, en donde si
    nuestro sistema no puede demostrar alguna propiedad, éste dirá que
    es falso.
    
** Clase 12
*** Listas en prolog

    - La lista vacía es una lista, y en prolog se denota como =[]=.

    - Si $x$ es un elemento de un conjunto cualquiera, y $xs$ es una
      lista con elementos de cualquier conjunto, entonces =[x|xs]= es
      una lista.

    - Son todas.


    Vamos a implementar la propiedad =contiene(x,L)=, que nos dirá si =x=
    está contenido en =L=.

    #+begin_src prolog
contiene(E,[E|XS]).
contiene(E,[_|XS]) :- contiene(E,XS).
    #+end_src

    Si queremos un predicado que calcula la suma de los elementos de
    una lista.
%@ 

    #+begin_src prolog
suma([],0).
suma([X],X).
suma([X|XS],Y) :-
    suma(XS,Z),
    Y is X + Z
    #+end_src

    Si queremos un predicado que calcule la concatenación de dos
    listas.

    #+begin_src prolog
concat(L1,[],L1).
concat([X|XS],L2,[X|ZS]) :- concat(XS,L2,ZS).
    #+end_src

    Si queremos un predicado que calcule la concatenación de dos
    listas.

    #+begin_src prolog
concat([],L2,L2)
concat([X|XS],L2,[X|ZS]) :- concat(XS,L2,ZS)

reversa([],[]).
reversa([X|XS],YS) :- reversa(XS,ZS), concat(ZS,[X],YS) 
    #+end_src    
** Clase 13
*** Ejercicios prolog
    
