notas/Declarativa/Notas.html

<div id="outline-container-org7f416fd" class="outline-4">
<h4 id="org7f416fd">Resolución binaria</h4>
<div class="outline-text-4" id="text-org7f416fd">
<p>
Es un método que permite decidir la consecuencia lógia
\(\Gamma\models\varphi\), al llegar a la cláusula vacía a partir del
conjunto \[\Gamma\cup\{\neg\ell\}\]
</p>

<p>
\(\infer{(C_1\vee D_1)\sigma}{C=_{\text{def}}C_1\vee\ell & D=_{\text{def}}D_1\vee\ell' & Var(C)\cap Var(D)=\emptyset & \sigma=umg\ de\ \{\ell^c,\ell'\}}\)
</p>
</div>
</div>
</div>




<div id="outline-container-orge94e0f1" class="outline-3">
<h3 id="orge94e0f1">Clase 7</h3>
<div class="outline-text-3" id="text-orge94e0f1">
</div>
<div id="outline-container-org7ebc54c" class="outline-4">
<h4 id="org7ebc54c">Resolución binaria</h4>
<div class="outline-text-4" id="text-org7ebc54c">
<ul class="org-ul">
<li>Forma clausular</li>
<li>Algoritmo de unificación</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org74a8bc2" class="outline-3">
<h3 id="org74a8bc2">Clase 8</h3>
<div class="outline-text-3" id="text-org74a8bc2">
</div>
<div id="outline-container-org813561e" class="outline-4">
<h4 id="org813561e">Programación lógica</h4>
<div class="outline-text-4" id="text-org813561e">
<p>
\(P(a)\leftarrow\)
\(H(b)\leftarrow\)
\(C(z)\leftarrow H(z)\)
</p>

<p>
\(\leftarrow C(x)\) Meta
\(\mathbb{P}\models C\)
</p>

<ol class="org-ol">
<li>\(\leftarrow H(z)\) Res\((4,3)\) \([x:=z]\)</li>
<li>\(\leftarrow\) Res(5,2) \([z:=b]\)</li>
</ol>


<p>
Hay dos procesos de búsqueda de pruebas en la programación lógica,
en la cual tenemos la búsqueda hacia atrás, y la búsqueda hacia
adelante.
</p>

<p>
En prolog, tenemos lo que se conoce como backtracking (o
retroceso)
</p>
</div>
</div>

<div id="outline-container-orgb5e0f1a" class="outline-4">
<h4 id="orgb5e0f1a">Árbol SLD</h4>
<div class="outline-text-4" id="text-orgb5e0f1a">
<p>
Tenemos el siguiente programa
</p>

<ol class="org-ol">
<li>\(p(a)\leftarrow\)</li>
<li>\(p(b)\leftarrow\)</li>
<li>\(q(a)\leftarrow\)</li>
<li>\(r(f(y))\leftarrow p(y), q(y)\)</li>
<li>\(\leftarrow r(x)\)</li>
<li>\(\leftarrow p(y),q(y)\)</li>
<li>\(\leftarrow q(a)\)</li>
</ol>
</div>
</div>

<div id="outline-container-org526267c" class="outline-4">
<h4 id="org526267c">Prolog</h4>
<div class="outline-text-4" id="text-org526267c">
<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">Tipos b&#225;sicos</span>
<span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">&#193;tomos (t&#233;rminos m&#225;s peque&#241;os)</span>
juanito
m
esto_es_un_atomo
x1
***
<span style="font-style: italic;">'esto es un &#225;tomo'</span>

<span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">Variables</span>
<span style="font-weight: bold; font-style: italic;">X</span>
<span style="font-weight: bold; font-style: italic;">EstoEsUnaVariable</span>
<span style="font-weight: bold; font-style: italic;">_var</span>
<span style="font-weight: bold; font-style: italic;">_</span>

<span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">N&#250;meros</span>
12313
1.92
-502

<span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">T&#233;rminos compuestos</span>
<span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">1. Funtor (&#225;tomo)</span>
<span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">2. Lista de argumentos</span>
<span style="font-weight: bold;">funtor</span>(a,b)
<span style="font-style: italic;">'funtorcito'</span>(termino)
<span style="font-weight: bold;">g</span>(f(a,b),h(c,d))
</pre>
</div>

<p>
Primero en prolog se definen hechos y reglas, si queremos un
programa para saber quién es más alto que alguien, tenemos lo
siguiente.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold; font-style: italic;">% </span><span style="font-weight: bold; font-style: italic;">Base de conocimientos</span>
<span style="font-weight: bold;">alto</span>(juan,adriana).
<span style="font-weight: bold;">alto</span>(ricardo,juan).
<span style="font-weight: bold;">alto</span>(javier,ricardo).
<span style="font-weight: bold;">alto</span>(alejandro,adriana).
<span style="font-weight: bold;">alto</span>(javier,alejandro).

<span style="font-weight: bold;">mas_alto</span>(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Y</span>) :- alto(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Y</span>).
<span style="font-weight: bold;">mas_alto</span>(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Y</span>) :- alto(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Z</span>), mas_alto(<span style="font-weight: bold; font-style: italic;">Z</span>,<span style="font-weight: bold; font-style: italic;">Y</span>).
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8598fdc" class="outline-3">
<h3 id="org8598fdc">Clase 9</h3>
<div class="outline-text-3" id="text-org8598fdc">
</div>
<div id="outline-container-orgeeac800" class="outline-4">
<h4 id="orgeeac800">Prolog</h4>
<div class="outline-text-4" id="text-orgeeac800">
<p>
Éste utiliza el principio del universo cerrado, en donde si
nuestro sistema no puede demostrar alguna propiedad, éste dirá que
es falso.
</p>
</div>
</div>
</div>

<div id="outline-container-org9d193e3" class="outline-3">
<h3 id="org9d193e3">Clase 12</h3>
<div class="outline-text-3" id="text-org9d193e3">
</div>
<div id="outline-container-orgbc66bbe" class="outline-4">
<h4 id="orgbc66bbe">Listas en prolog</h4>
<div class="outline-text-4" id="text-orgbc66bbe">
<ul class="org-ul">
<li>La lista vacía es una lista, y en prolog se denota como <code>[]</code>.</li>

<li>Si \(x\) es un elemento de un conjunto cualquiera, y \(xs\) es una
lista con elementos de cualquier conjunto, entonces <code>[x|xs]</code> es
una lista.</li>

<li>Son todas.</li>
</ul>


<p>
Vamos a implementar la propiedad <code>contiene(x,L)</code>, que nos dirá si <code>x</code>
está contenido en <code>L</code>.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">contiene</span>(<span style="font-weight: bold; font-style: italic;">E</span>,<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">E</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>).
<span style="font-weight: bold;">contiene</span>(<span style="font-weight: bold; font-style: italic;">E</span>,<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">_</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>) :- contiene(<span style="font-weight: bold; font-style: italic;">E</span>,<span style="font-weight: bold; font-style: italic;">XS</span>).
</pre>
</div>

<p>
    Si queremos un predicado que calcula la suma de los elementos de
    una lista.
%@ 
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[]</span>,0).
<span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">X</span>).
<span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">Y</span>) :-
    suma(<span style="font-weight: bold; font-style: italic;">XS</span>,<span style="font-weight: bold; font-style: italic;">Z</span>),
    <span style="font-weight: bold; font-style: italic;">Y</span> is <span style="font-weight: bold; font-style: italic;">X</span> + <span style="font-weight: bold; font-style: italic;">Z</span>
</pre>
</div>

<p>
Si queremos un predicado que calcule la concatenación de dos
listas.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">concat</span>(<span style="font-weight: bold; font-style: italic;">L1</span>,<span style="font-weight: bold;">[]</span>,<span style="font-weight: bold; font-style: italic;">L1</span>).
<span style="font-weight: bold;">concat</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">L2</span>,<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">ZS</span><span style="font-weight: bold;">]</span>) :- concat(<span style="font-weight: bold; font-style: italic;">XS</span>,<span style="font-weight: bold; font-style: italic;">L2</span>,<span style="font-weight: bold; font-style: italic;">ZS</span>).
</pre>
</div>

<p>
Si queremos un predicado que calcule la concatenación de dos
listas.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">concat</span>(<span style="font-weight: bold;">[]</span>,<span style="font-weight: bold; font-style: italic;">L2</span>,<span style="font-weight: bold; font-style: italic;">L2</span>)
<span style="font-weight: bold;">concat</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">L2</span>,<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">ZS</span><span style="font-weight: bold;">]</span>) :- concat(<span style="font-weight: bold; font-style: italic;">XS</span>,<span style="font-weight: bold; font-style: italic;">L2</span>,<span style="font-weight: bold; font-style: italic;">ZS</span>)

<span style="font-weight: bold;">reversa</span>(<span style="font-weight: bold;">[]</span>,<span style="font-weight: bold;">[]</span>).
<span style="font-weight: bold;">reversa</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">YS</span>) :- reversa(<span style="font-weight: bold; font-style: italic;">XS</span>,<span style="font-weight: bold; font-style: italic;">ZS</span>), concat(<span style="font-weight: bold; font-style: italic;">ZS</span>,<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">YS</span>) 
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd7dc2e8" class="outline-3">
<h3 id="orgd7dc2e8">Clase 13</h3>
<div class="outline-text-3" id="text-orgd7dc2e8">
</div>
<div id="outline-container-org1bc4381" class="outline-4">
<h4 id="org1bc4381">Ejercicios prolog</h4>
<div class="outline-text-4" id="text-org1bc4381">
</div>
<ul class="org-ul">
