content/notas/Declarativa/Notas.org
**** Contención

     #+begin_src prolog
contiene([H|_],H).
contiene([_|T],X) :- contiene(T,X).
     #+end_src

**** Suma de elementos de una lista (recursiva)

     #+begin_src prolog
suma([],0).
suma([H|T],S) :- suma(T,Z),
		 S is H + Z.
     #+end_src

** Clase 14
*** Prolog operadores

    Para verificar el valor numérico de una variable se utiliza el
    operador =is=.

    =X is 1 + 7.=

    Tiene las operaciones aritméticas comunes, como

    | Operaciones aritméticas | Operadores    |
    |-------------------------+---------------|
    | Suma                    | +             |
    | Resta                   | -             |
    | Multiplicación          | *             |
    | Division Real           | /             |
    | División Entera         | //            |
    | Potencia                | **            |
    | máximo                  | max           |
    | mínimo                  | min           |
    | raíz cuadrada           | sqrt          |
    | seno                    | sin           |
    | flotante                | float         |
    | redondeo                | round         |
    | menor que               | <             |
    | mayor que               | >             |
    | menor o igual           | =<            |
    | mayor o igual           | >=            |
    | distinto de             | = \ = (junto) |
    |                         | = : =         |


    Calcular el perímetro y área de un triángulo con lados a, b y c.

    #+begin_src prolog
lados(X,Y,Z).
triangulo(W,lados(X,Y,Z)).

perimetro(T,P) :- triángulo(T,lados(A,B,C)),
		  P is A + B + C.

semiperimetro(T,S) :- triangulo(T,lados(A,B,C)),
		      perimetro(T,P),
		      S is P / 2.

area(T,A) :- triangulo(T,lados(A,B,C)),
	     semiperimetro(T,S),
	     A is sqrt(S*(S-A)*(S-B)*(S-C)).
    #+end_src
    
*** Precedencia

    Es el orden en el que evaluamos las operaciones

    $5\times 2+3=(5\times 2)+3$

*** Asociatividad

    $A+(B+C)=(A+B)+C$

*** Definir operadores en prolog

    | Patrón | Significado             |
    |--------+-------------------------|
    | yfx    | infijo, asoc. izq       |
    | xfy    | infijo, asoc der        |
    | xfx    | infijo, sin regla asoc. |
    | fy     | prefijo                 |
    | fx     | prefijo                 |
    | yf     | postfijo                |
    | xf     | postfijo                |

    - f es la posición del operador

    - x y es la asociatividad, la y es la dirección en donde se asocia

**** current_op

     =?- current_op(Presedencia,Asociatividad,-)=.
     =@Presedencia = 200, Asociatividad = fy;=
     =@Precedencia = 500, Asociatividad = yfx.=
     
**** op

     =op(300,xfx,contiene).=
     =?- [1,2,3] contiene 1=.
     
