notas/Declarativa/Notas.html
<li><a id="org17a4da9"></a>Contención<br />
<div class="outline-text-5" id="text-org17a4da9">
<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">contiene</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">H</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">_</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">H</span>).
<span style="font-weight: bold;">contiene</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">_</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">T</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">X</span>) :- contiene(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">X</span>).
</pre>
</div>
</div>
</li>

<li><a id="orgabd587b"></a>Suma de elementos de una lista (recursiva)<br />
<div class="outline-text-5" id="text-orgabd587b">
<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[]</span>,0).
<span style="font-weight: bold;">suma</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">H</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">T</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">S</span>) :- suma(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">Z</span>),
                 <span style="font-weight: bold; font-style: italic;">S</span> is <span style="font-weight: bold; font-style: italic;">H</span> + <span style="font-weight: bold; font-style: italic;">Z</span>.
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbe1ebf5" class="outline-3">
<h3 id="orgbe1ebf5">Clase 14</h3>
<div class="outline-text-3" id="text-orgbe1ebf5">
</div>
<div id="outline-container-orgfae2d93" class="outline-4">
<h4 id="orgfae2d93">Prolog operadores</h4>
<div class="outline-text-4" id="text-orgfae2d93">
<p>
Para verificar el valor numérico de una variable se utiliza el
operador <code>is</code>.
</p>

<p>
<code>X is 1 + 7.</code>
</p>

<p>
Tiene las operaciones aritméticas comunes, como
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operaciones aritméticas</th>
<th scope="col" class="org-left">Operadores</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Suma</td>
<td class="org-left">+</td>
</tr>

<tr>
<td class="org-left">Resta</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">Multiplicación</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Division Real</td>
<td class="org-left">/</td>
</tr>

<tr>
<td class="org-left">División Entera</td>
<td class="org-left">//</td>
</tr>

<tr>
<td class="org-left">Potencia</td>
<td class="org-left">**</td>
</tr>

<tr>
<td class="org-left">máximo</td>
<td class="org-left">max</td>
</tr>

<tr>
<td class="org-left">mínimo</td>
<td class="org-left">min</td>
</tr>

<tr>
<td class="org-left">raíz cuadrada</td>
<td class="org-left">sqrt</td>
</tr>

<tr>
<td class="org-left">seno</td>
<td class="org-left">sin</td>
</tr>

<tr>
<td class="org-left">flotante</td>
<td class="org-left">float</td>
</tr>

<tr>
<td class="org-left">redondeo</td>
<td class="org-left">round</td>
</tr>

<tr>
<td class="org-left">menor que</td>
<td class="org-left">&lt;</td>
</tr>

<tr>
<td class="org-left">mayor que</td>
<td class="org-left">&gt;</td>
</tr>

<tr>
<td class="org-left">menor o igual</td>
<td class="org-left">=&lt;</td>
</tr>

<tr>
<td class="org-left">mayor o igual</td>
<td class="org-left">&gt;=</td>
</tr>

<tr>
<td class="org-left">distinto de</td>
<td class="org-left">= \ = (junto)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">= : =</td>
</tr>
</tbody>
</table>


<p>
Calcular el perímetro y área de un triángulo con lados a, b y c.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">lados</span>(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Y</span>,<span style="font-weight: bold; font-style: italic;">Z</span>).
<span style="font-weight: bold;">triangulo</span>(<span style="font-weight: bold; font-style: italic;">W</span>,lados(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Y</span>,<span style="font-weight: bold; font-style: italic;">Z</span>)).

<span style="font-weight: bold;">perimetro</span>(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">P</span>) :- tri&#225;ngulo(<span style="font-weight: bold; font-style: italic;">T</span>,lados(<span style="font-weight: bold; font-style: italic;">A</span>,<span style="font-weight: bold; font-style: italic;">B</span>,<span style="font-weight: bold; font-style: italic;">C</span>)),
                  <span style="font-weight: bold; font-style: italic;">P</span> is <span style="font-weight: bold; font-style: italic;">A</span> + <span style="font-weight: bold; font-style: italic;">B</span> + <span style="font-weight: bold; font-style: italic;">C</span>.

<span style="font-weight: bold;">semiperimetro</span>(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">S</span>) :- triangulo(<span style="font-weight: bold; font-style: italic;">T</span>,lados(<span style="font-weight: bold; font-style: italic;">A</span>,<span style="font-weight: bold; font-style: italic;">B</span>,<span style="font-weight: bold; font-style: italic;">C</span>)),
                      perimetro(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">P</span>),
                      <span style="font-weight: bold; font-style: italic;">S</span> is <span style="font-weight: bold; font-style: italic;">P</span> / 2.

<span style="font-weight: bold;">area</span>(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">A</span>) :- triangulo(<span style="font-weight: bold; font-style: italic;">T</span>,lados(<span style="font-weight: bold; font-style: italic;">A</span>,<span style="font-weight: bold; font-style: italic;">B</span>,<span style="font-weight: bold; font-style: italic;">C</span>)),
             semiperimetro(<span style="font-weight: bold; font-style: italic;">T</span>,<span style="font-weight: bold; font-style: italic;">S</span>),
             <span style="font-weight: bold; font-style: italic;">A</span> is sqrt(<span style="font-weight: bold; font-style: italic;">S</span>*(<span style="font-weight: bold; font-style: italic;">S</span>-<span style="font-weight: bold; font-style: italic;">A</span>)*(<span style="font-weight: bold; font-style: italic;">S</span>-<span style="font-weight: bold; font-style: italic;">B</span>)*(<span style="font-weight: bold; font-style: italic;">S</span>-<span style="font-weight: bold; font-style: italic;">C</span>)).
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb77f12a" class="outline-4">
<h4 id="orgb77f12a">Precedencia</h4>
<div class="outline-text-4" id="text-orgb77f12a">
<p>
Es el orden en el que evaluamos las operaciones
</p>

<p>
\(5\times 2+3=(5\times 2)+3\)
</p>
</div>
</div>

<div id="outline-container-orga1c7d59" class="outline-4">
<h4 id="orga1c7d59">Asociatividad</h4>
<div class="outline-text-4" id="text-orga1c7d59">
<p>
\(A+(B+C)=(A+B)+C\)
</p>
</div>
</div>

<div id="outline-container-org7d5b156" class="outline-4">
<h4 id="org7d5b156">Definir operadores en prolog</h4>
<div class="outline-text-4" id="text-org7d5b156">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Patrón</th>
<th scope="col" class="org-left">Significado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">yfx</td>
<td class="org-left">infijo, asoc. izq</td>
</tr>

<tr>
<td class="org-left">xfy</td>
<td class="org-left">infijo, asoc der</td>
</tr>

<tr>
<td class="org-left">xfx</td>
<td class="org-left">infijo, sin regla asoc.</td>
</tr>

<tr>
<td class="org-left">fy</td>
<td class="org-left">prefijo</td>
</tr>

<tr>
<td class="org-left">fx</td>
<td class="org-left">prefijo</td>
</tr>

<tr>
<td class="org-left">yf</td>
<td class="org-left">postfijo</td>
</tr>

<tr>
<td class="org-left">xf</td>
<td class="org-left">postfijo</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>f es la posición del operador</li>

<li>x y es la asociatividad, la y es la dirección en donde se asocia</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgf0a7b30"></a>current<sub>op</sub><br />
<div class="outline-text-5" id="text-orgf0a7b30">
<p>
<code>?- current_op(Presedencia,Asociatividad,-)</code>.
<code>@Presedencia = 200, Asociatividad = fy;</code>
<code>@Precedencia = 500, Asociatividad = yfx.</code>
</p>
</div>
</li>

<li><a id="org886713c"></a>op<br />
<div class="outline-text-5" id="text-org886713c">
<p>
<code>op(300,xfx,contiene).</code>
<code>?- [1,2,3] contiene 1</code>.
</p>
</div>
</li>
</ul>
</div>
