content/notas/Declarativa/Notas.org
*** No determinismo en prolog

    $AFN=(Q,\Sigma,\delta,q_0,F)$

    - $Q$ es el conjunto de estados
    - $\Sigma$ el alfabeto de entrada
    - $\delta\subseteq Q\times\Sigma\times Q$
    - $q_0$ es el estado inicial
    - $F$ es un estado final


    Definimos un autómata como sigue

    $Q=\{1,2,3\}$
    $\Sigma=\{a,b\}$
    $\delta=\{(1,b,2),(2,a,2),(2,a,3),(3,b,2)\}$
    $q_0=1$
    $F=\{3\}$

    En prolog, lo podríamos definir como sigue:

    #+begin_src prolog
estado(1).
estado(2).
estado(3).

inicial(1).

final(3).

transicion(1,b,2).
transicion(2,b,2).
transicion(2,a,3).
transicion(3,b,2).

aceptaAux([],Q) :- estado(Q),
		   final(Q).
aceptaAux([X|XS],Q) :- estado(Q),
		       transicion(Q,X,Q2),
		       aceptaAux(XS,Q2).

acepta(L) :- estado(Q),
	     inicial(Q),
	     aceptaAux(L,Q).
    #+end_src
    
** Clase 15
*** Fibonacci en prolog

    #+begin_src prolog
fibonacci(0,0).
fibonacci(0,1).
fibonacci(N,F) :- X is N - 1,
		  Y is N - 2,
		  fibonacci(X,F1),
		  fibonacci(Y,F2),
		  F is F1 + F2.
    #+end_src
    
*** Operador de corte en prolog

    Éste operador detiene el proceso de retroceso en un punto de
    elección dado.

    Éste corte se representa con el operador =!=

        #+begin_src prolog
fibonacci(0,0) :- !.
fibonacci(0,1) :- !.
fibonacci(N,F) :- X is N - 1,
		  Y is N - 2,
		  fibonacci(X,F1),
		  fibonacci(Y,F2),
		  F is F1 + F2.
    #+end_src
    
*** Negación como falla

    Sirve en situaciones dónde se desea verificar que una propiedad no
    se satisface.

    =\+= Una expresión de la forma =\+G= tendrá éxito siempre que =G= falle.

    #+begin_src prolog
comida_favorita(pedro,enchiladas).
comida_favorita(diana,pozole).

%?- comida_favorita(bety,X).
%% false.
%?- \+ comida_favorita(bety, X).
%% true.
    #+end_src

    Sin embargo esto no quiere decir que el predicado
    =comida_favorita(bety,X)= sea falso, sino que no hay información
    suficiente para probarlo.

    La negación como falla no va a unificar variables.

*** Programación funcional

**** Cálculo $\lambda$

     Éste consta de

     - Funciones
     - Aplicaciones
     - Variables


     El cáulculo $\lambda$ tiene sus significado a partir de las
     $\beta$ reducciones.

     Ésta $\beta$ reducción termina cuando se llega a una forma
     normal.

     $\alpha$ equivalencia es cuando dos expresiones lambdas tienen la
     misma forma, pero difieren en sus variables.

** Clase 16
*** Recursión de cola

    #+begin_src haskell
fact :: Int -> Int
fact 0 = 1
fact n = n * fact (n-1)
    #+end_src

    #+begin_src haskell
fact :: Int -> Int -> Int
fact 0 acc = acc
fact n acc = fact (n - 1) (acc * n)
    #+end_src

    #+begin_src haskell
aplana
longitud
concatena
    #+end_src
    
** Clase 17

*** Propiedad universal

    #+begin_src haskell
g [] = v
g (x:xs) = f x (g xs)

g = fold f v
    #+end_src

*** Principio de fusión

    #+begin_src haskell
h w = v
h (g x y) = f x (h y)

h . fold g w = fold f v
    #+end_src

** Clase 18

*** Evaluación perezosa

    *Beneficios*:

    - En ocasionas es rápida.
      
    - Utiliza paso por necesidad.

    - Se pueden manipular estructuras "infinitas".

*** Sistemas de tipos

    - Conjunto de reglas que indican cómo tipar una expresión
      sintácticamente válida.

    - Verificación de tipos estáticos (o dinámicos respectivamente)

*** Definición de tipos en Haskell

    =type= es para dar sinónimos de tipo.

    =data= Definición propia de tipo, al que se le pueden dar nombres,
    valores y operaciones.

*** Inferencia de tipos

    Se definen restricciones a partir del conocimiento previo que se
    tienen de las variables o funciones.

    Utiliza unificación para encontrar el tipo más general.

*** Clases de tipos

    =Eq= Son tipos cuyos valores tienen la operación de igualdad (====).

    =Ord= Son tipos cuyos valores pueden ser ordenados con operadores de
    desigualdad.

    =Show= Son tipos cuyos valores se pueden convertir a cadena.

    =Enum= Aquellos tipos que se pueden enumerar con su sucesor y
    predecesor.

    =Num= Aquellos tipos que tienen las operaciones para hacer
    operaciones numéricas.

** Clase 19

