notas/Declarativa/Notas.html

<div id="outline-container-orgddd57e0" class="outline-4">
<h4 id="orgddd57e0">No determinismo en prolog</h4>
<div class="outline-text-4" id="text-orgddd57e0">
<p>
\(AFN=(Q,\Sigma,\delta,q_0,F)\)
</p>

<ul class="org-ul">
<li>\(Q\) es el conjunto de estados</li>
<li>\(\Sigma\) el alfabeto de entrada</li>
<li>\(\delta\subseteq Q\times\Sigma\times Q\)</li>
<li>\(q_0\) es el estado inicial</li>
<li>\(F\) es un estado final</li>
</ul>


<p>
Definimos un autómata como sigue
</p>

<p>
\(Q=\{1,2,3\}\)
\(\Sigma=\{a,b\}\)
\(\delta=\{(1,b,2),(2,a,2),(2,a,3),(3,b,2)\}\)
\(q_0=1\)
\(F=\{3\}\)
</p>

<p>
En prolog, lo podríamos definir como sigue:
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">estado</span>(1).
<span style="font-weight: bold;">estado</span>(2).
<span style="font-weight: bold;">estado</span>(3).

<span style="font-weight: bold;">inicial</span>(1).

<span style="font-weight: bold;">final</span>(3).

<span style="font-weight: bold;">transicion</span>(1,b,2).
<span style="font-weight: bold;">transicion</span>(2,b,2).
<span style="font-weight: bold;">transicion</span>(2,a,3).
<span style="font-weight: bold;">transicion</span>(3,b,2).

<span style="font-weight: bold;">aceptaAux</span>(<span style="font-weight: bold;">[]</span>,<span style="font-weight: bold; font-style: italic;">Q</span>) :- estado(<span style="font-weight: bold; font-style: italic;">Q</span>),
                   final(<span style="font-weight: bold; font-style: italic;">Q</span>).
<span style="font-weight: bold;">aceptaAux</span>(<span style="font-weight: bold;">[</span><span style="font-weight: bold; font-style: italic;">X</span><span style="font-weight: bold;">|</span><span style="font-weight: bold; font-style: italic;">XS</span><span style="font-weight: bold;">]</span>,<span style="font-weight: bold; font-style: italic;">Q</span>) :- estado(<span style="font-weight: bold; font-style: italic;">Q</span>),
                       transicion(<span style="font-weight: bold; font-style: italic;">Q</span>,<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">Q2</span>),
                       aceptaAux(<span style="font-weight: bold; font-style: italic;">XS</span>,<span style="font-weight: bold; font-style: italic;">Q2</span>).

<span style="font-weight: bold;">acepta</span>(<span style="font-weight: bold; font-style: italic;">L</span>) :- estado(<span style="font-weight: bold; font-style: italic;">Q</span>),
             inicial(<span style="font-weight: bold; font-style: italic;">Q</span>),
             aceptaAux(<span style="font-weight: bold; font-style: italic;">L</span>,<span style="font-weight: bold; font-style: italic;">Q</span>).
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd3ef5d9" class="outline-3">
<h3 id="orgd3ef5d9">Clase 15</h3>
<div class="outline-text-3" id="text-orgd3ef5d9">
</div>
<div id="outline-container-orgba79901" class="outline-4">
<h4 id="orgba79901">Fibonacci en prolog</h4>
<div class="outline-text-4" id="text-orgba79901">
<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">fibonacci</span>(0,0).
<span style="font-weight: bold;">fibonacci</span>(0,1).
<span style="font-weight: bold;">fibonacci</span>(<span style="font-weight: bold; font-style: italic;">N</span>,<span style="font-weight: bold; font-style: italic;">F</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 1,
                  <span style="font-weight: bold; font-style: italic;">Y</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 2,
                  fibonacci(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">F1</span>),
                  fibonacci(<span style="font-weight: bold; font-style: italic;">Y</span>,<span style="font-weight: bold; font-style: italic;">F2</span>),
                  <span style="font-weight: bold; font-style: italic;">F</span> is <span style="font-weight: bold; font-style: italic;">F1</span> + <span style="font-weight: bold; font-style: italic;">F2</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org05a2660" class="outline-4">
<h4 id="org05a2660">Operador de corte en prolog</h4>
<div class="outline-text-4" id="text-org05a2660">
<p>
Éste operador detiene el proceso de retroceso en un punto de
elección dado.
</p>

<p>
Éste corte se representa con el operador <code>!</code>
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">fibonacci</span>(0,0) :- <span style="font-weight: bold;">!</span>.
<span style="font-weight: bold;">fibonacci</span>(0,1) :- <span style="font-weight: bold;">!</span>.
<span style="font-weight: bold;">fibonacci</span>(<span style="font-weight: bold; font-style: italic;">N</span>,<span style="font-weight: bold; font-style: italic;">F</span>) :- <span style="font-weight: bold; font-style: italic;">X</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 1,
                  <span style="font-weight: bold; font-style: italic;">Y</span> is <span style="font-weight: bold; font-style: italic;">N</span> - 2,
                  fibonacci(<span style="font-weight: bold; font-style: italic;">X</span>,<span style="font-weight: bold; font-style: italic;">F1</span>),
                  fibonacci(<span style="font-weight: bold; font-style: italic;">Y</span>,<span style="font-weight: bold; font-style: italic;">F2</span>),
                  <span style="font-weight: bold; font-style: italic;">F</span> is <span style="font-weight: bold; font-style: italic;">F1</span> + <span style="font-weight: bold; font-style: italic;">F2</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org851b1e8" class="outline-4">
<h4 id="org851b1e8">Negación como falla</h4>
<div class="outline-text-4" id="text-org851b1e8">
<p>
Sirve en situaciones dónde se desea verificar que una propiedad no
se satisface.
</p>

<p>
<code>\+</code> Una expresión de la forma <code>\+G</code> tendrá éxito siempre que <code>G</code> falle.
</p>

<div class="org-src-container">
<pre class="src src-prolog"><span style="font-weight: bold;">comida_favorita</span>(pedro,enchiladas).
<span style="font-weight: bold;">comida_favorita</span>(diana,pozole).

<span style="font-weight: bold; font-style: italic;">%</span><span style="font-weight: bold; font-style: italic;">?- comida_favorita(bety,X).</span>
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">false.</span>
<span style="font-weight: bold; font-style: italic;">%</span><span style="font-weight: bold; font-style: italic;">?- \+ comida_favorita(bety, X).</span>
<span style="font-weight: bold; font-style: italic;">%% </span><span style="font-weight: bold; font-style: italic;">true.</span>
</pre>
</div>

<p>
Sin embargo esto no quiere decir que el predicado
<code>comida_favorita(bety,X)</code> sea falso, sino que no hay información
suficiente para probarlo.
</p>

<p>
La negación como falla no va a unificar variables.
</p>
</div>
</div>

<div id="outline-container-org26f14dc" class="outline-4">
<h4 id="org26f14dc">Programación funcional</h4>
<div class="outline-text-4" id="text-org26f14dc">
</div>
<ul class="org-ul">
<li><a id="org4d1a889"></a>Cálculo \(\lambda\)<br />
<div class="outline-text-5" id="text-org4d1a889">
<p>
Éste consta de
</p>

<ul class="org-ul">
<li>Funciones</li>
<li>Aplicaciones</li>
<li>Variables</li>
</ul>


<p>
El cáulculo \(\lambda\) tiene sus significado a partir de las
\(\beta\) reducciones.
</p>

<p>
Ésta \(\beta\) reducción termina cuando se llega a una forma
normal.
</p>

<p>
\(\alpha\) equivalencia es cuando dos expresiones lambdas tienen la
misma forma, pero difieren en sus variables.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1bed1e0" class="outline-3">
<h3 id="org1bed1e0">Clase 16</h3>
<div class="outline-text-3" id="text-org1bed1e0">
</div>
<div id="outline-container-orga9f254d" class="outline-4">
<h4 id="orga9f254d">Recursión de cola</h4>
<div class="outline-text-4" id="text-orga9f254d">
<div class="org-src-container">
<pre class="src src-haskell">fact :: Int -&gt; Int
fact 0 = 1
fact n = n * fact (n-1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">fact :: Int -&gt; Int -&gt; Int
fact 0 acc = acc
fact n acc = fact (n - 1) (acc * n)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">aplana
longitud
concatena
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2684573" class="outline-3">
<h3 id="org2684573">Clase 17</h3>
<div class="outline-text-3" id="text-org2684573">
</div>
<div id="outline-container-org93a0088" class="outline-4">
<h4 id="org93a0088">Propiedad universal</h4>
<div class="outline-text-4" id="text-org93a0088">
<div class="org-src-container">
<pre class="src src-haskell">g [] = v
g (x:xs) = f x (g xs)

g = fold f v
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb621d83" class="outline-4">
<h4 id="orgb621d83">Principio de fusión</h4>
<div class="outline-text-4" id="text-orgb621d83">
<div class="org-src-container">
<pre class="src src-haskell">h w = v
h (g x y) = f x (h y)

h . fold g w = fold f v
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5e8def" class="outline-3">
<h3 id="orgb5e8def">Clase 18</h3>
<div class="outline-text-3" id="text-orgb5e8def">
</div>
<div id="outline-container-org7c62dc9" class="outline-4">
<h4 id="org7c62dc9">Evaluación perezosa</h4>
<div class="outline-text-4" id="text-org7c62dc9">
<p>
<b>Beneficios</b>:
</p>

<ul class="org-ul">
<li>En ocasionas es rápida.</li>

<li>Utiliza paso por necesidad.</li>

<li>Se pueden manipular estructuras "infinitas".</li>
</ul>
</div>
</div>

<div id="outline-container-org6738045" class="outline-4">
<h4 id="org6738045">Sistemas de tipos</h4>
<div class="outline-text-4" id="text-org6738045">
<ul class="org-ul">
<li>Conjunto de reglas que indican cómo tipar una expresión
sintácticamente válida.</li>

<li>Verificación de tipos estáticos (o dinámicos respectivamente)</li>
</ul>
</div>
</div>

<div id="outline-container-org719ce0c" class="outline-4">
<h4 id="org719ce0c">Definición de tipos en Haskell</h4>
<div class="outline-text-4" id="text-org719ce0c">
<p>
<code>type</code> es para dar sinónimos de tipo.
</p>

<p>
<code>data</code> Definición propia de tipo, al que se le pueden dar nombres,
valores y operaciones.
</p>
</div>
</div>

<div id="outline-container-orgec44e48" class="outline-4">
<h4 id="orgec44e48">Inferencia de tipos</h4>
<div class="outline-text-4" id="text-orgec44e48">
<p>
Se definen restricciones a partir del conocimiento previo que se
tienen de las variables o funciones.
</p>

<p>
Utiliza unificación para encontrar el tipo más general.
</p>
</div>
</div>

<div id="outline-container-orge9172ac" class="outline-4">
<h4 id="orge9172ac">Clases de tipos</h4>
<div class="outline-text-4" id="text-orge9172ac">
<p>
<code>Eq</code> Son tipos cuyos valores tienen la operación de igualdad (<code>==</code>).
</p>

<p>
<code>Ord</code> Son tipos cuyos valores pueden ser ordenados con operadores de
desigualdad.
</p>

<p>
<code>Show</code> Son tipos cuyos valores se pueden convertir a cadena.
</p>

<p>
<code>Enum</code> Aquellos tipos que se pueden enumerar con su sucesor y
predecesor.
</p>

<p>
<code>Num</code> Aquellos tipos que tienen las operaciones para hacer
operaciones numéricas.
</p>
</div>
</div>
</div>
