content/notas/Declarativa/Notas.org
*** Kinds

    Son familias de tipos, de los cuales pueden haber =*= y =* -> *=

    #+begin_src haskell
Bool :: *
Int :: *
Maybe :: * -> *
Either :: * -> * -> *

newtype Coleccion t a = Coleccion (t a)
Coleccion :: (* -> *) -> * -> *

Num :: * -> Constraint
Eq :: * -> Constraint
Ord :: * -> Constraint
    #+end_src

** Clase 20

*** Construcción del sistema

    #+begin_src haskell
data Verdadero = Verdadero
data Falso
    #+end_src

    Decimos que el tipo de dato Verdadero representa el valor de
    verdad Verdadero, porque siempre que tenemos este tipo, tenemos
    presente su único constructor. Itra firma de representar el valor
    Verdadero usando únicamente cosas ya definidas en Haskell, es con
    el tipo ()

    Mientras que falso es un tipo de dato inalcanzable.

    Tenemos también operadores como el siguiente.

    #+begin_src haskell
data Y a b = Y a b
data O a b = OIzq a | ODer b
    #+end_src

    Y la negación la podemos escribir como lo siguiente;

    #+begin_src haskell
type No a = a -> Falso
    #+end_src

    Las variables proposicionales serían las variables de tipos.

    La impricación sería sencillamente el tipo función =a->b=

    
**** Cuantificación

** Clase 21

*** Funtores, funtores aplicativos y mónadas

    - Cálcula Lambda: CUrrigicación, beta reducciones, funciones de
      orden superior, lambdas, etc...

    - Teoría de Categorías: Categorías

      * Una categoría es una colección de objetos y morfismos entre
        ellos.

    - Lógica y Teoría de Tipos - Categorías Cartesianamente Cerradas.
  
**** Funtores

     #+begin_src haskell
inc :: [Int] -> [Int]
inc [] = []
inc (x:xs) = (x+1):inc xs

sqr :: [Int] -> [Int]
sqr [] = []
sqr (x:xs) = (n^2):sqr xs
     #+end_src

     La idea del map es posible generalizarla para cualquier tipo de
     estructura de datos.


     #+begin_src haskell
class Functor f where
  fmap :: (a -> b) -> f a -> f b
     #+end_src

     Un ejemplo con las listas

     #+begin_src haskell
instance Functor [] where
  fmap = map
     #+end_src

     Otro ejemplo con =Maybe=
     
     #+begin_src haskell
instance Functor Maybe where
  fmap _ Nothing = Nothing
  fmap f (Just x) = Just $ f x
     #+end_src

     Si tenemos árboles definidos como sigue, la instancia de Funtores es la siguiente:

     #+begin_src haskell
data Tree a = Leaf a
            | Node (Tree a) (Tree a)

instance Functor Tree where
  fmap f (Leaf x) = Leaf $ f x
  fmap d (Node l r) = Node (fmap f l) (fmap f r)
     #+end_src

     La instancia de =IO= sería como sigue:

     #+begin_src haskell
instance Functor IO where
  fmap f mx = do
    x <- mx
    return $ f x
     #+end_src

***** Propiedades de funtores

      - =fmap id = id=
	
      - =fmap (f.g) = fmap g . fmap h=


      Por ejemplo, supongamos que se tiene la siguiente definición de
      =fmap= para listas.

      #+begin_src haskell
fmap g [] = []
fmap f (x:xs) = fmap g xs ++ [g x]
      #+end_src

      No cumple la propiedad pues después de la aplicación de la
      función a un elemento de la lista, entonces =g x= se manda al
      final, por lo que aplicar la identidad nos devuelve la reversa
      de la lista.
	
**** Aplicativos

     #+begin_src haskell
pure :: a -> f a -- construye contextos a partir de valores
(<*>) :: f (a -> b) -> f a -> f b -- generaliza la aplicación de
                                  -- función que mantiene todo dentro
                                  -- de contextos.
     #+end_src
     
** Clase 22

*** Programación funcional

    - Elegante: Menos código, descriptivo (autodocumentable), legible.

    - Seguridad del Sistema de Tipos: Cumple preservación y progreso.

    - Inferencia de Tipos: Polimorfismo paramétrico.

    - Funciones de orden superior: El que se puedan utilizar las
      mismas funciones como valores en el lenguaje es lo que se le
      conoce que las funciones sean de primera clase y así mismo
      permitan realizar funciones de orden superior.

      Permite abstraer esquemas recursivos y por tanto reducir código.

    - Se dificulta operar con el estado

    - Tienen una curva de aprendizaje alta.

      - Requieren un alto nivel de abstracción (nivel superior).

    - Comunidad pequeña enfocada en la academia.

*** Lenguajes multiparadigma

    - Integran cosas de varios estilos de programación.

    - Lo mejor de varios estilos.

* Tareas [1/2]

  - [X] Investigar las características declarativas de *prolog*.
  - [ ] Tarea 1
