notas/Declarativa/Notas.html

<div id="outline-container-org6b26a3b" class="outline-3">
<h3 id="org6b26a3b">Clase 19</h3>
<div class="outline-text-3" id="text-org6b26a3b">
</div>
<div id="outline-container-org91dd823" class="outline-4">
<h4 id="org91dd823">Kinds</h4>
<div class="outline-text-4" id="text-org91dd823">
<p>
Son familias de tipos, de los cuales pueden haber <code>*</code> y <code>* -&gt; *</code>
</p>

<div class="org-src-container">
<pre class="src src-haskell">Bool :: *
Int :: *
Maybe :: * -&gt; *
Either :: * -&gt; * -&gt; *

newtype Coleccion t a = Coleccion (t a)
Coleccion :: (* -&gt; *) -&gt; * -&gt; *

Num :: * -&gt; Constraint
Eq :: * -&gt; Constraint
Ord :: * -&gt; Constraint
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org596bb17" class="outline-3">
<h3 id="org596bb17">Clase 20</h3>
<div class="outline-text-3" id="text-org596bb17">
</div>
<div id="outline-container-org96181f9" class="outline-4">
<h4 id="org96181f9">Construcción del sistema</h4>
<div class="outline-text-4" id="text-org96181f9">
<div class="org-src-container">
<pre class="src src-haskell">data Verdadero = Verdadero
data Falso
</pre>
</div>

<p>
Decimos que el tipo de dato Verdadero representa el valor de
verdad Verdadero, porque siempre que tenemos este tipo, tenemos
presente su único constructor. Itra firma de representar el valor
Verdadero usando únicamente cosas ya definidas en Haskell, es con
el tipo ()
</p>

<p>
Mientras que falso es un tipo de dato inalcanzable.
</p>

<p>
Tenemos también operadores como el siguiente.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Y a b = Y a b
data O a b = OIzq a | ODer b
</pre>
</div>

<p>
Y la negación la podemos escribir como lo siguiente;
</p>

<div class="org-src-container">
<pre class="src src-haskell">type No a = a -&gt; Falso
</pre>
</div>

<p>
Las variables proposicionales serían las variables de tipos.
</p>

<p>
La impricación sería sencillamente el tipo función <code>a-&gt;b</code>
</p>
</div>


<ul class="org-ul">
<li><a id="orgb3898ce"></a>Cuantificación<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org9eed503" class="outline-3">
<h3 id="org9eed503">Clase 21</h3>
<div class="outline-text-3" id="text-org9eed503">
</div>
<div id="outline-container-org685f981" class="outline-4">
<h4 id="org685f981">Funtores, funtores aplicativos y mónadas</h4>
<div class="outline-text-4" id="text-org685f981">
<ul class="org-ul">
<li>Cálcula Lambda: CUrrigicación, beta reducciones, funciones de
orden superior, lambdas, etc&#x2026;</li>

<li>Teoría de Categorías: Categorías

<ul class="org-ul">
<li>Una categoría es una colección de objetos y morfismos entre
ellos.</li>
</ul></li>

<li>Lógica y Teoría de Tipos - Categorías Cartesianamente Cerradas.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org35295bf"></a>Funtores<br />
<div class="outline-text-5" id="text-org35295bf">
<div class="org-src-container">
<pre class="src src-haskell">inc :: [Int] -&gt; [Int]
inc [] = []
inc (x:xs) = (x+1):inc xs

sqr :: [Int] -&gt; [Int]
sqr [] = []
sqr (x:xs) = (n^2):sqr xs
</pre>
</div>

<p>
La idea del map es posible generalizarla para cualquier tipo de
estructura de datos.
</p>


<div class="org-src-container">
<pre class="src src-haskell">class Functor f where
  fmap :: (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<p>
Un ejemplo con las listas
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Functor [] where
  fmap = map
</pre>
</div>

<p>
Otro ejemplo con <code>Maybe</code>
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Functor Maybe where
  fmap _ Nothing = Nothing
  fmap f (Just x) = Just $ f x
</pre>
</div>

<p>
Si tenemos árboles definidos como sigue, la instancia de Funtores es la siguiente:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Tree a = Leaf a
            | Node (Tree a) (Tree a)

instance Functor Tree where
  fmap f (Leaf x) = Leaf $ f x
  fmap d (Node l r) = Node (fmap f l) (fmap f r)
</pre>
</div>

<p>
La instancia de <code>IO</code> sería como sigue:
</p>

<div class="org-src-container">
<pre class="src src-haskell">instance Functor IO where
  fmap f mx = do
    x &lt;- mx
    return $ f x
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="org4f4fc5a"></a>Propiedades de funtores<br />
<div class="outline-text-6" id="text-org4f4fc5a">
<ul class="org-ul">
<li><code>fmap id = id</code></li>

<li><code>fmap (f.g) = fmap g . fmap h</code></li>
</ul>


<p>
Por ejemplo, supongamos que se tiene la siguiente definición de
<code>fmap</code> para listas.
</p>

<div class="org-src-container">
<pre class="src src-haskell">fmap g [] = []
fmap f (x:xs) = fmap g xs ++ [g x]
</pre>
</div>

<p>
No cumple la propiedad pues después de la aplicación de la
función a un elemento de la lista, entonces <code>g x</code> se manda al
final, por lo que aplicar la identidad nos devuelve la reversa
de la lista.
</p>
</div>
</li>
</ul>
</li>

<li><a id="orgaafdaa6"></a>Aplicativos<br />
<div class="outline-text-5" id="text-orgaafdaa6">
<div class="org-src-container">
<pre class="src src-haskell">pure :: a -&gt; f a -- construye contextos a partir de valores
(&lt;*&gt;) :: f (a -&gt; b) -&gt; f a -&gt; f b -- generaliza la aplicación de
                                  -- función que mantiene todo dentro
                                  -- de contextos.
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd80ba31" class="outline-3">
<h3 id="orgd80ba31">Clase 22</h3>
<div class="outline-text-3" id="text-orgd80ba31">
</div>
<div id="outline-container-orge23d911" class="outline-4">
<h4 id="orge23d911">Programación funcional</h4>
<div class="outline-text-4" id="text-orge23d911">
<ul class="org-ul">
<li>Elegante: Menos código, descriptivo (autodocumentable), legible.</li>

<li>Seguridad del Sistema de Tipos: Cumple preservación y progreso.</li>

<li>Inferencia de Tipos: Polimorfismo paramétrico.</li>

<li><p>
Funciones de orden superior: El que se puedan utilizar las
mismas funciones como valores en el lenguaje es lo que se le
conoce que las funciones sean de primera clase y así mismo
permitan realizar funciones de orden superior.
</p>

<p>
Permite abstraer esquemas recursivos y por tanto reducir código.
</p></li>

<li>Se dificulta operar con el estado</li>

<li>Tienen una curva de aprendizaje alta.

<ul class="org-ul">
<li>Requieren un alto nivel de abstracción (nivel superior).</li>
</ul></li>

<li>Comunidad pequeña enfocada en la academia.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc093e0d" class="outline-4">
<h4 id="orgc093e0d">Lenguajes multiparadigma</h4>
<div class="outline-text-4" id="text-orgc093e0d">
<ul class="org-ul">
<li>Integran cosas de varios estilos de programación.</li>

<li>Lo mejor de varios estilos.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org23dad15" class="outline-2">
<h2 id="org23dad15">Tareas <code>[1/2]</code></h2>
<div class="outline-text-2" id="text-org23dad15">
<ul class="org-ul">
<li class="on"><code>[X]</code> Investigar las características declarativas de <b>prolog</b>.</li>
<li class="off"><code>[&#xa0;]</code> Tarea 1</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2023-08-08 Tue 22:26</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>